[
  {
    "name": "Perun",
    "knownAs": "God of the Sky and Thunder",
    "image": "/perun/perun-main.webp",
    "avatar": "/perun/ava.webp",
    "description": "# Perun — God of Thunder and War\n\n## Role and Attributes\nPerun is the powerful god of thunder, lightning, war, and rain, embodying both fire and iron. He is the patron of warriors, protector of the military, and often associated with leadership.\n\n- **Control over natural forces**: thunder, lightning, and rain\n- **Military protection**: protector of warriors, akin to Mars or Taranis\n\n## Mythological Parallels\nPerun's role resembles other Indo-European thunder gods:\n\n- **Zeus** in Greek mythology\n- **Jupiter** in Roman tradition\n- **Thor** in Norse myths\n- **Indra** in Vedic lore\n\n## Symbols and Iconography\nDepicted with weapons like an axe, hammer, or arrows, Perun's symbols include:\n\n- **Oak**: sacred tree associated with him\n- **Eagle**: animal symbolizing his might\n- **Perun's Stones**: believed to be thunderstones\n\n## Customs and Beliefs\nCertain taboos and customs were observed around thunder and lightning, as Perun was feared and revered as a bringer of storms and justice.\n\n### Fun Facts\n- The folk hero Kotygoroshko may be inspired by Perun.\n- **Sayings**: \"adding pepper\" relates to Perun's fiery persona.",
    "information": {
      "perun": {
        "weapon": "hammer, mace or axe",
        "battles": "battle of perun and veles",
        "animals": "eagle",
        "symbol": "oak, fire, iris"
      },
      "genealogy": {
        "consort": "mokosh, perunika or dodola",
        "children": "jarilo and morana"
      },
      "equivalents": {
        "indoeuropean": "perkwunos",
        "norse": "thor",
        "finnic": "ukko or uku",
        "baltic": "perkūnas"
      }
    },
    "places": "## Perun: The Slavic God of Thunder and War\n\n  <Place float='right' image={'/perun/perun.webp'}>\n    **Perun** is one of the most revered and powerful gods in Slavic mythology, known as the **God of Thunder, War, and the Sky**. Often compared to the Norse god Thor or the Greek god Zeus, Perun is depicted as a mighty, bearded figure wielding a **thunderbolt** and embodying the forces of order, protection, and justice. His realm is in the skies, and he is often associated with oak trees, a symbol of strength and endurance in Slavic culture.\n\n    In Slavic cosmology, Perun is seen as a protector of warriors and the community, striking down enemies and oath-breakers with lightning. He represents the ideal of a courageous, decisive, and fair leader who ensures balance and order. Perun's thunderous presence was both feared and respected, as lightning strikes were viewed as divine punishments or warnings.\n  </Place>\n\n  ### Worship of Perun\n\n  **Perun** was often worshiped on hilltops or near sacred oak trees, places believed to be close to his domain in the sky. Unlike Veles, who was worshiped in the lowlands and marketplaces, Perun’s shrines were typically built in elevated areas, emphasizing his status as the ruler of the heavens. Devotees would perform sacrifices, particularly of bulls, and light fires to honor him, seeking his protection and favor in matters of war and governance.\n\n  As one of the primary gods of the Kievan Rus, Perun held a special position in early Slavic states, where he was invoked by rulers and warriors alike. His legacy as the god of thunder and war has endured as a symbol of strength and leadership in Slavic culture."
  },
  {
    "name": "Veles",
    "knownAs": "God of the Earth and Underworld",
    "image": "/veles/veles-main.webp",
    "avatar": "/veles/ava.webp",
    "description": "# Veles — God of the Earth, Waters, and the Underworld\n\n## Role and Attributes\nVeles is the Slavic god of the earth, forests, waters, and the underworld, associated with wealth, trickery, music, and magic. Known as a shape-shifter, Veles moves between worlds, symbolizing duality and mystery.\n\n- **Domains**: forests, waters, cattle, and prosperity\n- **Patron of**: magicians, musicians, and tricksters\n\n## Symbols and Festivals\nVeles is celebrated during the **Festival of Veles** in winter, representing transition and rebirth.\n\n- **Symbol**: willow tree, marking his connection to water and the underworld\n- **Animals**: wolf, snake, dragon, symbolizing his shapeshifting nature\n\n## Mythological Parallels\nHis equivalents in other mythologies are:\n\n- **Hades and Hermes** in Greek\n- **Loki and Odin** in Norse\n\n## Fun Facts\nVeles is the rival of Perun, representing earthly powers versus sky powers, creating a cosmic balance.",
    "information": {
      "veles": {
        "godOf": "earth, waters, forests, underworld, music, magic, trickery, cattle, and wealth",
        "abode": "Nav, Slavic afterlife",
        "weapon": "spear",
        "battles": "battle of perun and veles",
        "animals": "wolf, bear, snake, dragon, owl",
        "symbol": "willow",
        "festivals": "the festival of veles"
      },
      "equivalents": {
        "christian": "saint blaise",
        "greek": "hades, hermes",
        "indoeuropean": "welnos",
        "norse": "hela, loki, odin",
        "prussian": "peckols"
      }
    },
    "places": "## Veles: The Slavic God of Cattle and Commerce\n\n  <Place float='left' image={'/veles/veles.jpg'}>\n    **Veles** is one of the few Slavic gods for whom evidence of offerings can be found across all Slavic nations. The *Primary Chronicle*, a historical record of early Kievan Rus, is the earliest and most important document that mentions a god named **Volos** multiple times. In these accounts, Volos is described as the **god of cattle and peasants**, who would punish oath-breakers with diseases—a contrast to [**Perun**](https://en.wikipedia.org/wiki/Perun), the ruling god of war who punished by death in battle.\n\n    In the latter half of the 10th century, **Vladimir I of Kiev** had statues of seven gods erected in his city, with Veles (or Volos) among them. Interestingly, Veles' statue did not stand on the hill with others near the prince's castle but was placed lower in the city, in the marketplace. This suggests a connection between **Veles** and commerce and also illustrates the separation in worship of Perun and Veles: while Perun's shrines were built high on hills, **Veles** belonged in the lowlands, closer to the people and trade.\n  </Place>\n\n  ### Etymology and Symbolism of Veles\n\n  <Place float='right' image={'/veles/wolf-form.jpg'}>\n    One possibility is that the name **Veles** derives from the Proto-Indo-European root [*wel-*](https://en.wikipedia.org/wiki/Proto-Indo-European_root#wel), meaning wool. This theory is plausible, as in Slavic cosmology, Veles, in his serpentine form, is said to lie in a nest of black wool at the roots of the [**Tree of the World**](https://en.wikipedia.org/wiki/World_tree) and acts as the shepherd of the dead.\n\n    The word *Volos* also means \"hair\" in Russian and Ukrainian, and Veles is often described as hairy in his beastly forms, such as a bear or wolf. However, since the early 20th century and the advent of Proto-Indo-European laryngeal theory, the term for \"wool\" has been reconstructed as *h₂wĺ̥h₁neh₂*, making this etymology more complex but still culturally significant.\n  </Place>\n\n  ### Cultural Impact and Worship Practices\n\n  The unique placement of Veles’ statue in the marketplace, separate from the hilltop shrines, shows how deeply Veles was associated with commerce and the everyday lives of the Slavic people. This also underscores the symbolic division between Veles, connected with the earth, commerce, and the underworld, and Perun, the sky god of war and rulership. The clear separation of their worship spaces suggests a balance between these two forces in Slavic mythology."
  },
  {
    "name": "Dazhbog",
    "knownAs": "God of the Sun and Prosperity",
    "image": "/dazhbog/dazhbog-main.webp",
    "avatar": "/dazhbog/ava.webp",
    "description": "# Dazhbog — God of the Sun and Prosperity\n\n## Role and Attributes\nDazhbog is the bringer of warmth, light, and prosperity, often seen as a god of abundance and fortune. As the sun deity, he is associated with sunlight, harvest, and the turning of seasons.\n\n- **God of**: Sun, abundance, and fortune\n- **Symbol**: fire, reflecting his solar power\n\n## Myths and Family\nDazhbog is believed to be the son of Svarog, symbolizing continuity and fertility. His possible children, **the Zoryas**, are goddesses of dawn and dusk.\n\n## Celebrations\nHe is especially honored during the **Summer Solstice** when the sun reaches its peak.\n\n### Fun Facts\nSome scholars connect Dazhbog with other sun deities, like the Greek **Helios**. His role in folklore symbolizes both life-giving force and cosmic continuity.",
    "information": {
      "dazhbog": {
        "godOf": "sun, abundance, prosperity, fortune",
        "abode": "sky, palace of the sun",
        "weapon": "rays of sunlight, chariot",
        "animals": "wolf, falcon",
        "symbol": "sun, fire",
        "festivals": "celebrations around the summer solstice"
      },
      "genealogy": {
        "father": "Svarog",
        "children": "possibly the Zoryas (dawn goddesses)"
      }
    },
    "places": "## Dazhbog: The Slavic God of the Sun and Prosperity\n\n  <Place float='left' image={'/dazhbog/dazhbog.webp'}>\n    **Dazhbog** (also spelled Dazhdbog) is a prominent deity in Slavic mythology, often associated with the sun, wealth, and abundance. Known as the **God of the Sun**, Dazhbog is believed to bring prosperity, fertility, and light to the world, embodying the warmth and life-giving energy of the sun. In some interpretations, he is thought to be a cultural hero, spreading blessings and good fortune across the land.\n\n    As one of the few gods directly linked to the sun in Slavic pantheon, **Dazhbog** played a central role in the daily lives and beliefs of ancient Slavs. Some sources describe him as a **\"giver god\"** who generously bestows wealth and power, while others view him as a cosmic guardian, ensuring the continuation of life and growth.\n  </Place>\n\n  ### The Legacy of Dazhbog\n\n  In Slavic folklore, **Dazhbog** is often referred to as a divine ancestor of the Slavic people, and some medieval sources even call him the father of the Slavs. His presence is linked to the daily sunrise and sunset, symbolizing the cycles of life, death, and renewal. This connection to natural cycles made Dazhbog a figure of reverence, especially among farmers and communities relying on the rhythms of nature for survival.\n\n  Dazhbog’s influence extended beyond just mythology; he was often invoked in prayers and rituals to ensure bountiful harvests, warm weather, and general prosperity. The legacy of Dazhbog remains a testament to the ancient Slavs' deep respect for the sun and its critical role in sustaining life."
  },
  {
    "name": "Rod",
    "knownAs": "God of Family, Ancestors, and Fate",
    "image": "/rod/rod-main.webp",
    "avatar": "/rod/ava.webp",
    "description": "# Rod — God of Family, Ancestors, and Fate\n\n## Role and Attributes\nRod is the primordial deity in Slavic mythology, revered as the creator of life and the protector of family, ancestry, and fate. He is considered the source of all life and the keeper of the divine order, ensuring harmony between the living and their ancestors.\n\n- **Domains**: family, ancestors, creation, and fate\n- **Patron of**: families, kinship, and tradition\n\n## Symbols and Festivals\nRod is celebrated during the **Festival of Rod and Rozhanitsy**, a time to honor ancestors and seek blessings for family and fate.\n\n- **Symbol**: birch tree, representing life, renewal, and connection to the ancestors\n- **Animals**: rooster and crane, symbolizing vigilance and the link between worlds\n\n## Mythological Parallels\nHis equivalents in other mythologies are:\n\n- **Ancestral spirits (Manes)** in Roman mythology\n- **Uranus and Ananke** in Greek mythology\n\n## Fun Facts\nRod is often accompanied by the Rozhanitsy, female deities associated with childbirth and destiny. Together, they represent the sacred bond between generations and the intertwining threads of fate.",
    "information": {
      "rod": {
        "godOf": "family, ancestors, creation, fate, and divine order",
        "abode": "connection between the mortal world and the divine",
        "weapon": "none (symbol of peace and harmony)",
        "battles": "none (primordial and neutral deity)",
        "animals": "rooster, crane",
        "symbol": "birch tree",
        "festivals": "festival of rod and rozhanitsy"
      },
      "equivalents": {
        "roman": "manes",
        "greek": "uranus, ananke",
        "indoeuropean": "creator deity (dyēus)",
        "norse": "urd (fate), ancestral spirits",
        "hindu": "pitra (ancestors)"
      }
    },
    "places": "## Rod: The Primordial Creator and Keeper of Kinship\n\n  <Place float='left' image={'/rod/rod.webp'}>\n    **Rod** holds a unique position in Slavic mythology as the progenitor of all life and the protector of familial bonds. In ancient Slavic belief, Rod is not only the god of creation but also the overseer of the ties that bind the living to their ancestors. Worship of Rod often took place at the family hearth or sacred groves, emphasizing his close connection to everyday life.\n\n    The Rozhanitsy, often linked to Rod, are viewed as divine mothers or fate-weavers, underscoring the communal and familial focus of Slavic spirituality. During the **Festival of Rod and Rozhanitsy**, offerings of bread, honey, and milk were made to seek protection, prosperity, and harmony in the family.\n  </Place>\n\n  ### Etymology and Symbolism of Rod\n\n  <Place float='right' image={'/rod/family-symbol.jpg'}>\n    The name **Rod** is derived from the Proto-Slavic root *rodъ*, meaning \"birth,\" \"kinship,\" or \"lineage.\" This highlights Rod's fundamental role as the god of origin and the sustainer of life. The birch tree, sacred to Rod, symbolizes purity, new beginnings, and the continuity of life through generations.\n\n    In Slavic cosmology, Rod is seen as the force that unites the living and the dead, ensuring that the bonds of kinship endure beyond the mortal realm. The rooster, another symbol of Rod, represents vigilance and the passage of time, heralding the continuity of life.\n  </Place>\n\n  ### Cultural Impact and Worship Practices\n\n  Worship of Rod was deeply personal and centered around the family unit. Unlike other deities who had large public shrines, Rod was often honored at the hearth, where offerings were made to ensure family prosperity and to honor the ancestors. This intimate form of worship reflects the significance of kinship and tradition in Slavic culture.\n\n  The Festival of Rod and Rozhanitsy is one of the most heartfelt celebrations in Slavic traditions, symbolizing the cyclical nature of life and the unbreakable connection between past, present, and future generations."
  }
]
